// 定义图标数字键的键值对象
// 这些键值对应需要显示为图标而非文本的按键
export const NUM_KEY = {
    // 功能键区域 (62208-62224)
    62208: 'Mode',
    62209: 'Color', 
    62210: 'Bri+',
    62211: 'Bri-',
    62212: 'Spd+',
    62213: 'Spd-', 
    62214: 'Prev',
    62215: 'OnOff',
    62216: 'Dir',
    62217: 'LockWin',
    62218: '',
    62219: '',
    62220: '',
    62221: '',
    62222: '',
    62223: '',
    62224: '灯效模式+',
    62225: '灯光方向',
    62226: '主灯亮度+',
    62227: '主灯亮度-',
    62228: '主灯速度+',
    62229: '主灯速度-',
    62231: '主灯开关',

    62245: '氛围灯模式+',
    62246: '氛围灯开关',
    62247: '氛围灯方向',
    62248: '氛围灯速度+',
    62249: '氛围灯速度-',
    62250: '氛围灯亮度+',
    62251: '氛围灯亮度-',
    62252: '氛围灯模式-',
    62255: '主灯模式-',
    
    // 特殊功能键
    61953: 'Win',
    61954: 'Mac',
    
    // 媒体控制键
    8586: 'Vol-',
    8596: 'Mute', 
    8739: 'Vol+',
    8579: 'Music',
    

    29441: '鼠标左键',
    29442: '鼠标右键',
    29443: '鼠标滚轮点击',
    29444: '鼠标左移',
    29445: '鼠标右移',
    29446: '鼠标下移',
    29447: '鼠标上移',
    29448: '滚轮+',
    29449: '滚轮-',


    4277: '下一首',
    4278: '上一首',
    4279: '停止',
    4301: '播放',
    4322: 'Mute',
    4329: '声音+',
    4330: '声音-',
    4483: 'Media',
    4490: 'Email',
    4498: 'Calc',
    127: 'Mute',
    128: '声音+',
    129: '声音-',
    173: '播放',
    174: '下一首',
    175: 'Ptrack',
    176: '停止',
    177: 'Mute',
    178: '声音+',
    179: '声音-',
    181: 'Email',
    182: 'Calc',
    183: 'PC',
    61696: '恢复',
    61697: 'Win',
    61698: 'Mac',
    61699: '校准',
    62217: 'LockWin',
    
    4500: 'File', // 打开文件管理器
    4643: 'www', // 浏览器打开一个新页面

};

// V2版本键盘的图标键配置
export const NUM_KEY_V2 = {

    // 鼠标
    16640: '鼠标左键',
    16896: '鼠标右键',
    17152: '鼠标滚轮点击',
    17408: '鼠标Forward',
    17664: '鼠标Back',


};
